#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=PXuzYA]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.random_password.master_password[0]: Refreshing state... [id=none]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_partition.current: Reading...
module.us-east-1.data.aws_ami.amazon_linux_2: Reading...
module.us-east-1.module.platform.module.ansible_server.aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::023093918714:oidc-provider/token.actions.githubusercontent.com]
module.us-east-1.module.platform.module.ansible_server.aws_kms_key.ansible_bucket_key: Refreshing state... [id=426dee1a-1411-4848-86d7-00559cb93f5f]
module.us-east-1.aws_key_pair.terraform-aws: Refreshing state... [id=terraform-aws-dev]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=grafana-rds-dev-20220826071900561400000001]
module.us-east-1.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-057288cbe12a3241a]
module.us-east-1.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b6a9d9da5278f304]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role.ansible_ec2_role: Refreshing state... [id=ec2_ansible_role-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role.codepipeline_role: Refreshing state... [id=codepipeline_ansible_role-dev]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.us-east-1.module.platform.module.ansible_server.aws_s3_bucket.codepipeline_bucket: Refreshing state... [id=codepipeline-ansible-ktech-br-dev]
module.us-east-1.module.platform.module.ansible_server.data.aws_caller_identity.current: Reading...
module.us-east-1.module.platform.module.ansible_server.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.us-east-1.module.platform.module.ansible_server.aws_codedeploy_app.ansible: Refreshing state... [id=e4e50686-b226-40c1-800b-a64addd693c1:ansible-app-dev]
module.us-east-1.data.aws_availability_zones.az_zones: Reading...
module.us-east-1.data.aws_ami.ubuntu2004: Reading...
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=1813475199]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role.codedeploy_role: Refreshing state... [id=ansible_codedeploy_role-dev]
module.us-east-1.data.aws_availability_zones.az_zones: Read complete after 0s [id=us-east-1]
module.us-east-1.module.platform.module.ansible_server.aws_codedeploy_deployment_config.ansible: Refreshing state... [id=ansible-deployment-config-dev]
module.us-east-1.module.platform.module.ansible_server.aws_kms_alias.key_alias: Refreshing state... [id=alias/ansible-bucket-key]
module.us-east-1.data.aws_ami.amazon_linux_2: Read complete after 0s [id=ami-0cabc39acf991f4f1]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role.github_role: Refreshing state... [id=github_ansible_role-dev]
module.us-east-1.module.platform.module.ansible_server.aws_s3_bucket_acl.codepipeline_bucket: Refreshing state... [id=codepipeline-ansible-ktech-br-dev,private]
module.us-east-1.module.platform.module.ansible_server.aws_s3_bucket_versioning.codepipeline_bucket: Refreshing state... [id=codepipeline-ansible-ktech-br-dev]
module.us-east-1.data.aws_ami.ubuntu2004: Read complete after 0s [id=ami-0cf6c10214cc015c9]
module.us-east-1.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-01638e156a2acbe49]
module.us-east-1.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-08ad62b02168826c0]
module.us-east-1.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-093b3509df974dfd4]
module.us-east-1.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0b67eef80709868b3]
module.us-east-1.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-06868f6060fc9ca8f]
module.us-east-1.module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-025c963e790930880]
module.us-east-1.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0af1957293a80fea2]
module.us-east-1.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0050e98ea2b38bbd4]
module.us-east-1.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0d1cb136b08e88177]
module.us-east-1.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-031c10a7b7f076e62]
module.us-east-1.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00937a690e6c083b5]
module.us-east-1.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0c75c958995362234]
module.us-east-1.module.zones.aws_route53_zone.this["dev.private.ktech-br.com"]: Refreshing state... [id=Z092901114WC1S1Z6MLWG]
module.us-east-1.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-085fa490cb445ed3b]
module.us-east-1.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-08fa7cd6f3288ddd7]
module.us-east-1.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0cffd49ef6db4b743]
module.us-east-1.module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=vpc-us-east-1-dev]
module.us-east-1.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0bb44ca075ed0aa5e]
module.us-east-1.module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0ef3b33f1984da88b]
module.us-east-1.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-04fdb100b0f787d19]
module.us-east-1.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0d1cb136b08e881771080289494]
module.us-east-1.module.platform.aws_security_group.allow_outbound: Refreshing state... [id=sg-06d072446c1659744]
module.us-east-1.module.platform.aws_security_group.allow_ping: Refreshing state... [id=sg-0f48e46630979d25f]
module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.sg_grafana_http: Refreshing state... [id=sg-0f64dadaff4382374]
module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.grafana_http_instance: Refreshing state... [id=sg-0f7851c5f42fbdba8]
module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.sg_grafana_https: Refreshing state... [id=sg-0fa8a44234f244f0d]
module.us-east-1.module.platform.module.bastion.aws_security_group.bastion_public_ssh: Refreshing state... [id=sg-04ecf420f20362e1e]
module.us-east-1.module.platform.module.ansible_server.aws_iam_instance_profile.ansible_ec2_profile: Refreshing state... [id=ec2_ansible_profile-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy_attachment.AWSCodeDeployRole: Refreshing state... [id=ansible_codedeploy_role-dev-20220826071901263000000002]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.ansible_ec2_policy: Refreshing state... [id=ec2_ansible_role-dev:ec2_ansible_policy-dev]
module.us-east-1.module.platform.module.ansible_server.aws_codedeploy_deployment_group.ansible: Refreshing state... [id=cb39e749-4574-42d6-ab00-fcdc1555ed82]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.ansible_ec2_policy_inventory: Refreshing state... [id=ec2_ansible_role-dev:ec2_ansible_policy_inventory-dev]
module.us-east-1.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08449037dc4b21055]
module.us-east-1.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04f8986ebe4ecaff0]
module.us-east-1.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-02229772beed281a7]
module.us-east-1.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01413ceb9d8b86546]
module.us-east-1.module.platform.module.grafana_dashboards.module.sg_grafana_db.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-06f2a2d1d405e2ede]
module.us-east-1.module.platform.aws_security_group.allow_ansible_admin_subnet_ssh: Refreshing state... [id=sg-0c412bb5607ba98c8]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.github_policy: Refreshing state... [id=github_ansible_role-dev:github_ansible_policy-dev]
module.us-east-1.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-08ad62b02168826c01080289494]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=grafana-rds-dev]
module.us-east-1.module.platform.module.bastion.module.ec2-instance.aws_instance.this[0]: Refreshing state... [id=i-08cb1d270aa1debe7]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.codepipeline_policy: Refreshing state... [id=codepipeline_ansible_role-dev:codepipeline_policy-dev]
module.us-east-1.module.platform.module.ansible_server.aws_codepipeline.codepipeline: Refreshing state... [id=ansible-deploy-pipeline-dev]
module.us-east-1.module.platform.aws_security_group.allow_bastion_ssh: Refreshing state... [id=sg-052e56cc378dd071a]
module.us-east-1.module.platform.module.ansible_server.module.ec2-instance.aws_instance.this[0]: Refreshing state... [id=i-01c0781c3f9d2cd35]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.us-east-1.module.vpc.aws_eip.nat[0] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-0d45c43e118a37524"
        id                   = "eipalloc-057288cbe12a3241a"
      + network_interface    = "eni-071f2866090ca62cd"
      + private_dns          = "ip-10-1-101-98.ec2.internal"
      + private_ip           = "10.1.101.98"
        tags                 = {
            "Name" = "vpc-us-east-1-dev-us-east-1a"
        }
        # (8 unchanged attributes hidden)
    }

  # module.us-east-1.module.vpc.aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-08ad62b02168826c0"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-04f8986ebe4ecaff0"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "vpc-us-east-1-dev-private"
        }
        # (5 unchanged attributes hidden)
    }

  # module.us-east-1.module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0d1cb136b08e88177"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-06868f6060fc9ca8f"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "vpc-us-east-1-dev-public"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = "ipv4"
      + load_balancer_type         = "application"
      + name                       = "alb-grafana-dashboards-dev"
      + security_groups            = [
          + "sg-0f64dadaff4382374",
          + "sg-0fa8a44234f244f0d",
        ]
      + subnets                    = [
          + "subnet-01638e156a2acbe49",
          + "subnet-0b67eef80709868b3",
        ]
      + tags                       = {
          + "App"  = "grafana-dashboards"
          + "Name" = "alb-grafana-dashboards-dev"
        }
      + tags_all                   = {
          + "App"       = "grafana-dashboards"
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "alb-grafana-dashboards-dev"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "pref-"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "App"  = "grafana-dashboards"
          + "Name" = "pref-"
        }
      + tags_all                           = {
          + "App"       = "grafana-dashboards"
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "pref-"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0b6a9d9da5278f304"

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_target_group_attachment.this["0.target"] will be created
  + resource "aws_lb_target_group_attachment" "this" {
      + id               = (known after apply)
      + port             = 3000
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.ec2-instance.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0cabc39acf991f4f1"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "us-east-1b"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "terraform-aws-dev"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-01638e156a2acbe49"
      + tags                                 = {
          + "App"  = "grafana-dashboards"
          + "Name" = "grafana-dashboards01-dev"
          + "Type" = "t2.micro"
        }
      + tags_all                             = {
          + "App"       = "grafana-dashboards"
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "grafana-dashboards01-dev"
          + "Type"      = "t2.micro"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "39048a59378f2ffa048a4d1d92c05521fefc2ee8"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "grafana-dashboards01-dev"
        }
      + vpc_security_group_ids               = [
          + "sg-052e56cc378dd071a",
          + "sg-06d072446c1659744",
          + "sg-0c412bb5607ba98c8",
          + "sg-0f48e46630979d25f",
          + "sg-0f7851c5f42fbdba8",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.sg_grafana_db.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = (known after apply)
      + description              = "PostgreSQL access from within VPC"
      + from_port                = 5432
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = "sg-06f2a2d1d405e2ede"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Reference to undefined provider

  on main.tf line 22, in module "us-east-1":
  22:     aws = aws.use1

There is no explicit declaration for local provider name "aws" in
module.us-east-1, so Terraform is assuming you mean to pass a configuration
for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kaio6fellipe, Action: `pull_request`*